 SORT FIELDS=COPY                                                               
 OUTREC IFTHEN=(WHEN=(45,2,BI,EQ,18),OVERLAY=(45:+70,TO=BI,LENGTH=2),           
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(45,2,BI,EQ,23),OVERLAY=(45:+74,TO=BI,LENGTH=2),              
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(103,2,BI,EQ,18),OVERLAY=(103:+70,TO=BI,LENGTH=2),            
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(103,2,BI,EQ,23),OVERLAY=(103:+74,TO=BI,LENGTH=2),            
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(161,2,BI,EQ,18),OVERLAY=(161:+70,TO=BI,LENGTH=2),            
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(161,2,BI,EQ,23),OVERLAY=(161:+74,TO=BI,LENGTH=2),            
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(219,2,BI,EQ,18),OVERLAY=(219:+70,TO=BI,LENGTH=2),            
     HIT=NEXT),                                                                 
     IFTHEN=(WHEN=(219,2,BI,EQ,23),OVERLAY=(219:+74,TO=BI,LENGTH=2),            
     HIT=NEXT)                                                                  
