 OUTFIL BUILD=(1:C'END 00000000 00000001 00000000 00000000 00000000 000X        
 00000 00000000',14X)                                                           
 SORT FIELDS=(1,3,A),FORMAT=BI                                                  
 OPTION ZDPRINT                                                                 
