 SORT FIELDS=(1,5,A),FORMAT=CH,EQUALS                                           
 OUTFIL FNAMES=OUT1,                                                            
 OUTREC=(1,5,6:+0,TO=PD,LENGTH=6,+0,TO=PD,LENGTH=6,                             
         (-4096),ZD,LENGTH=12)                                                  
