 SORT FIELDS=(54,9,CH,A)                                                        
 SUM FIELDS=NONE                                                                
 OMIT   COND=(1,1,CH,LE,C' ')                                                   
 OUTREC FIELDS=(54,9,                                                           
 10:1C'USD')                                                                    
