 SORT FIELDS=(54,9,CH,A),EQUALS                                                 
 SUM FIELDS=NONE                                                                
 OMIT   COND=(49,1,CH,LE,C' ')                                                  
