   SORT FIELDS=(54,9,CH,A,50,3,CH,A),EQUALS                                     
   SUM FIELDS=NONE                                                              
