 SORT FIELDS=COPY                                                               
 OUTREC OVERLAY=(1:1,123,1X,&DATE1-5)                                           
