  SORT FIELDS=COPY                                                              
   OUTFIL FILES=1,INCLUDE=(20,1,CH,EQ,C'I')                                     
   END                                                                          
