  SORT FIELDS=COPY                                                              
   OUTFIL FILES=1,INCLUDE=(20,1,CH,EQ,C'N')                                     
   OUTFIL FILES=2,INCLUDE=(20,2,CH,EQ,C'WA',                                    
   OR,20,2,CH,EQ,C'2A')                                                         
   OUTFIL FILES=3,INCLUDE=(20,1,CH,EQ,C'B',AND,                                 
   21,14,CH,GT,X'4040404040404040404040404040')                                 
   END                                                                          
