  JOINKEYS FILE=F1,FIELDS(1,100,A)                                      00010000
  JOINKEYS FILE=F2,FIELDS(1,100,A)                                      00020000
  JOIN UNPAIRED,F1,F2,ONLY                                              00030000
  REFORMAT FIELDS=(F1:1,100,F2:1,100)                                   00040000
  SORT FIELDS=COPY                                                      00050000
