  SORT FIELDS=(1,1,A,50,3,A),                                                   
  FORMAT=BI,EQUALS                                                              
