  JOINKEYS FILE=F1,FIELDS=(06,6,A)                                              
   JOINKEYS FILE=F2,FIELDS=(40,6,A)                                             
   SORT FIELDS=(20,2,CH,A,99,3,CH,A,74,1,CH,A,116,3,ZD,A)                       
   REFORMAT FIELDS=(F2:1,120,F1:26,1,F2:122,58)                                 
   OUTFIL FNAMES=SORTOUT,OUTREC=(C'1740',1,19,C'190000',20,2,                   
   26,6,32,4,C'783',95,4,C'00000',46,6,52,12,                                   
   66,8,74,1,CHANGE=(2,C'0',C'B ',                                              
   C'1',C'R ',                                                                  
   C'2',C'R ',                                                                  
   C'3',C'R '),                                                                 
   NOMATCH=(C' '),                                                              
   22,4,C'00000',40,6,75,20,C'M',                                               
   20,2,CHANGE=(1,C'91',C'U',                                                   
   C'92',C'C'),                                                                 
   NOMATCH=(C' '),                                                              
   121,1,C' ',99,21,C'000',123,5,129,31)                                        
