  SORT FIELDS=(20,8,CH,A,79,4,CH,A),EQUALS                                      
   SUM FIELDS=NONE                                                              
