  SORT FIELDS=(1,53,CH,A),EQUALS                                                
   SUM FIELDS=NONE                                                              
   OUTREC FIELDS=(54,2000)                                                      
