  SORT FIELDS=(17,1,CH,A)                                                       
   INCLUDE COND=(16,1,BI,EQ,C'8')                                               
