  SORT FIELDS=COPY                                                              
  OUTFIL FILES=1,INCLUDE=(5,1,CH,NE,C'9',AND,5,1,CH,NE,C'Z',                    
  AND,5,1,CH,NE,C'C')                                                           
  OUTFIL FILES=2,INCLUDE=(5,1,CH,NE,C'9',AND,5,1,CH,NE,C'Z',                    
  AND,5,1,CH,NE,C'C')                                                           
  OUTFIL FILES=3,INCLUDE=(5,1,CH,EQ,C'9',OR,5,1,CH,EQ,C'Z')                     
  OUTFIL FILES=4,INCLUDE=(5,1,CH,EQ,C'9',AND,6,2,CH,EQ,C'2 ',                   
  AND,(73,4,CH,EQ,C'0210',OR,92,4,CH,EQ,C'0210'))                               
  OUTFIL FILES=5,INCLUDE=(5,1,CH,EQ,C'C')                                       
  END                                                                           
