  JOINKEYS FILE=F1,FIELDS(1,100,A)                                              
  JOINKEYS FILE=F2,FIELDS(1,100,A)                                              
  JOIN UNPAIRED,F2,ONLY                                                         
  REFORMAT FIELDS=(F1:1,100,F2:1,100)                                           
  SORT FIELDS=COPY                                                              
