  SORT FIELDS=(1,13,CH,A)                                                       
   OUTREC FIELDS=(1:14,900)                                                     
