  SORT FIELDS=(9,3,CH,A,12,6,CH,A)                                              
   INCLUDE COND=(81,4,CH,GT,C'1000')                                            
