  SORT FIELDS=(5,53,CH,A),EQUALS                                                
  SUM FIELDS=NONE                                                               
  OUTREC FIELDS=(1,4,5:58)                                                      
