  SORT FIELDS=(1,19,ZD,A,20,19,ZD,A,66,2,BI,A,39,10,CH,D),EQUALS        00010002
  SUM FIELDS=NONE                                                       00020004
