SORT FIELDS=COPY                                                      
  OUTREC IFTHEN=(WHEN=(1,1,CH,NE,X'C1'),                              
          BUILD=(1,20,21,15,TRAN=ETOA,C'***************')),IFTHEN=(WHEN=(NONE),BUILD=(1,20,21,15,TRAN=ETOA,15X))
