SORT FIELDS=COPY                                                      
  OUTREC IFTHEN=(WHEN=(1,1,CH,EQ,C'A'),                              
          BUILD=(1,50,TRAN=ETOA)),IFTHEN=(WHEN=(NONE),BUILD=(1,20,21,15,TRAN=ETOA,15X))
