SORT FIELDS=COPY                                                      
  OUTREC IFTHEN=(WHEN=(1,1,CH,EQ,C'A'),                              
          BUILD=(1,50,TRAN=ETOA))		  
		
		  
