SORT FIELDS=COPY                                                      
  OUTFIL FILES=01,IFTHEN=(WHEN=(1,1,CH,EQ,C'A'),                              
          BUILD=(1,50,TRAN=ETOA))
