  DEFINE CLUSTER -                                                              
   (NAME (CLOUDFRM.IDCAMS.MONITOR) -                                            
    IXD               -                                                         
    UNIQUE            -                                                         
    CYL(10,10) -                                                                
    CONTROLINTERVALSIZE(4096) -                                                 
    RECSZ(281,281) -                                                            
    FREESPACE(10,10)  -                                                         
    VOLUMES(CLFR01 )  -                                                         
    IMBED  -                                                                    
    NOREPLICATE -                                                               
    SHAREOPTIONS(2,3)) -                                                        
   DATA (NAME (CLOUDFRM.IDCAMS.MONITOR.DATA) -                                  
            KEYS(65,0)) -                                                       
   INDEX (NAME (CLOUDFRM.IDCAMS.MONITOR.INDEX))                                 
