  INREC  IFTHEN=(WHEN=(1,3,CH,EQ,C'AK1'),
         BUILD=(1:1,44,45:C'  ',47:45,8))
  OMIT FORMAT=BI,COND=(01,3,EQ,C'END')
  SORT FIELDS=(1,3,A,4,43,A),FORMAT=BI
  SUM  FIELDS=(47,8,ZD)
  OUTREC IFTHEN=(WHEN=(1,3,CH,EQ,C'AK1'),
         BUILD=(1:1,44,45:47,8))
  OPTION ZDPRINT
