 SORT FIELDS=(1,29,A),FORMAT=BI                                                 
 SUM FIELDS=(30,8,ZD)                                                           
 OPTION ZDPRINT                                                                 
