SORT FIELDS=COPY 
OUTREC FIELDS=(1,91,5000:X) 
OUTFIL REMOVECC,HEADER1=(1:'HEADER-',9:'UNLOADED TABLE FOR IOS',32:'TGPAPQD',40:'04/10/2023','@','09:52:04'),TRAILER1=(1:'NUMBER OF RECORDS FOR TGPAPQD: ',COUNT=(M11,LENGTH=9))
