  SORT FIELDS=(1,55,CH,A)                                               00020009
  SUM FIELDS=NONE                                                       00021009
  OMIT COND=(1,3,CH,EQ,C'TRL')                                          00030007
  OUTFIL REMOVECC,                                                      00040007
  TRAILER1=('TRL',COUNT-1=(M11,LENGTH=11))                              00050007
