  JOINKEYS FILE=F1,FIELDS=(1,19,A,                                      00020003
                          20,19,A,                                      00030003
                          39,2,A,                                       00040003
                          41,2,A,                                       00050003
                          43,3,A,                                       00060003
                          46,11,A)                                      00070004
  JOINKEYS FILE=F2,FIELDS=(1,19,A,                                      00080003
                          20,19,A,                                      00090003
                          39,2,A,                                       00100003
                          41,2,A,                                       00110003
                          43,3,A,                                       00120003
                          46,11,A)                                      00130004
  JOIN UNPAIRED,F1,ONLY                                                 00140003
  REFORMAT FIELDS=(F1:1,42,47,10,43,3,57,4)                             00150010
  SORT FIELDS=COPY                                                      00160015
  OUTREC BUILD=(1,59,69X)                                               00170010
