 SORT FIELDS=(1,8,CH,A),EQUALS                                                  
  INREC IFTHEN=(WHEN=(26,3,CH,NE,C'USD'),OVERLAY=(26:C'USD'))                   
  SUM  FIELDS=NONE                                                              
