 SORT FIELDS=COPY                                                               
 OMIT    COND=(54,9,EQ,C'CUSIP6191',OR,54,9,EQ,C'CUSIP6701'),                   
         FORMAT=CH                                                              
