 SORT FIELDS=(40,07,CH,A)                                                       
 INCLUDE COND=(49,01,CH,GT,C' ',AND,40,01,CH,NE,X'FF')                          
 OUTREC FIELDS=(40,07,C'0')                                                     
 SUM FIELDS=NONE                                                                
