 SORT FIELDS=(54,9,CH,A,50,3,CH,A)                                              
 SUM FIELDS=NONE                                                                
 INCLUDE COND=(54,9,EQ,C'CUSIP6191',OR,54,9,EQ,C'CUSIP6701'),                   
         FORMAT=CH                                                              
