 SORT   FIELDS=(1,8,CH,A),EQUALS                                                
 SUM    FIELDS=NONE                                                             
 OMIT   COND=(1,1,CH,LE,C' ')                                                   
 OUTREC FIELDS=(1,8,                                                            
                10,3,CHANGE=(3,C'   ',C'USD'),                                  
                     NOMATCH=(10,3))                                            
