*REPLACE THE SMMS7010 SORT CARD FOR SRQ7737138 R2019Q3                  00010006
  SORT FIELDS=COPY                                                      00020004
  ALTSEQ CODE=(0437,052D,062E,072F,0816,0905,0A25,143C,153D,1632,       00030004
                1726,1A3F,1B27,2040,215A,227F,237B,245B,256C,2650,      00040004
                277D,284D,295D,2A5C,2B4E,2C6B,2D60,2E4B,2F61,30F0,      00050004
                31F1,32F2,33F3,34F4,35F5,36F6,37F7,38F8,39F9,3A7A,      00060004
                3B5E,3C4C,3D7E,3E6E,3F6F,407C,41C1,42C2,43C3,44C4,      00070004
                45C5,46C6,47C7,48C8,49C9,4AD1,4BD2,4CD3,4DD4,4ED5,      00080004
                4FD6,50D7,51D8,52D9,53E2,54E3,55E4,56E5,57E6,58E7,      00090004
                59E8,5AE9,5B4A,5CE0,5D5A,5EB0,5F6D,6079,6181,6282,      00100004
                6383,6484,6585,6686,6787,6888,6989,6A91,6B92,6C93,      00110004
                6D94,6E95,6F96,7097,7198,7299,73A2,74A3,75A4,76A5,      00120004
                77A6,78A7,79A8,7AA9,7BC0,7C4F,7DD0,7EA1,7F07,8020,      00130004
                8121,8222,8323,8424,8515,8606,8717,8828,8929,8A2A,      00140004
                8B2B,8C2C,8D09,8E0A,8F1B,9030,9131,921A,9333,9434,      00150004
                9535,9636,9708,9838,9939,9A3A,9B3B,9C04,9D14,9E3E,      00160004
                9FE1,A041,A142,A243,A344,A445,A546,A647,A748,A849,      00170004
                A951,AA52,AB53,AC54,AD55,AE56,AF57,B058,B159,B262,      00180004
                B363,B464,B565,B666,B767,B868,B969,BA70,BB71,BC72,      00190004
                BD73,BE74,BF75,C076,C177,C278,C380,C48A,C58B,C68C,      00200004
                C78D,C88E,C98F,CA90,CB9A,CC9B,CD9C,CE9D,CF9E,D09F,      00210004
                D1A0,D2AA,D3AB,D4AC,D5AD,D6AE,D7AF,D8B0,D9B1,DAB2,      00220004
                DBB3,DCB4,DDB5,DEB6,DFB7,E0B8,E1B9,E2BA,E3BB,E4BC,      00230004
                E5BD,E6BE,E7BF,E8CA,E9CB,EACC,EBCD,ECCE,EDCF,EEDA,      00240004
                EFDB,F0DC,F1DD,F2DE,F3DF,F4EA,F5EB,F6EC,F7ED,F8EE,      00250004
                F9EF)                                                   00260004
   OUTFIL FILES=01,                                                     00270004
        IFTHEN=(WHEN=(1,2,CH,EQ,X'3031',OR,1,2,CH,EQ,X'3032',           00280004
                      OR,1,2,CH,EQ,X'3430'),                            00290004
            BUILD=(1,2,TRAN=ALTSEQ,                                     00300004
                   3,12,                                                00310004
                   15,4723,TRAN=ALTSEQ,                                 00320004
                   4738,255,                                            00330004
                   4993,03,TRAN=ALTSEQ,                                 00340004
                   4996,255,                                            00350004
                   5251,7038,TRAN=ALTSEQ)),                             00360004
        IFTHEN=(WHEN=(1,2,CH,EQ,X'3030',OR,1,2,CH,EQ,X'3939'),          00370004
            BUILD=(1,12288,TRAN=ALTSEQ)),                               00380004
        IFTHEN=(WHEN=(1,2,CH,NE,X'3031',AND,1,2,CH,NE,X'3032',          00390004
                  AND,1,2,CH,NE,X'3430',AND,1,2,CH,NE,X'3030',          00400004
                  AND,1,2,CH,NE,X'3939'),                               00410004
            BUILD=(1,2,TRAN=ALTSEQ,                                     00420004
                   3,12,                                                00430004
                   15,12274,TRAN=ALTSEQ)),                              00440004
             OMIT=(1,2,CH,EQ,X'4040',OR,1,2,CH,EQ,X'2020')              00450004
