SORT FIELDS=COPY
OUTFIL FILES=01,OMIT=(05,02,CH,EQ,C'02')
OUTFIL FILES=02,INCLUDE=(05,02,CH,EQ,C'02')
OUTFIL FILES=03,
OMIT=((05,02,CH,EQ,C'01',AND,       
        640,01,CH,EQ,C'6',AND,       
       1152,10,ZD,EQ,0),OR,         
        (05,02,CH,EQ,C'00')),        
OUTREC=(07,06,13,09,66,19,3100,4),CONVERT
