SORT FIELDS=COPY
  OUTFIL FILES=01,INCLUDE=(1,2,CH,EQ,C'00'),ACCEPT=1
  OUTFIL FILES=02,INCLUDE=(1,2,CH,EQ,C'99'),ACCEPT=1
  OUTFIL FILES=03,OMIT=(1,2,CH,EQ,C'00',OR,1,2,CH,EQ,C'99')
