  SORT FIELDS=(1,1,CH,D,2,12,CH,A)                                      00010000
* SPLIT HEADER RECORDS AND NON-HEADER RECORDS INTO DIFFERENT FILES      00020000
  OUTFIL INCLUDE=(1,1,CH,EQ,C'H'),                                      00030000
  FNAMES=HDR,                                                           00040000
  REMOVECC                                                              00050000
  OUTFIL FNAMES=NOTHDR,SAVE,                                            00060000
  REMOVECC                                                              00070000
