 SORT FIELDS=(1,13,A),FORMAT=BI                                                 
* SPLIT HEADER RECORDS AND NON-HEADER RECORDS INTO DIFFERENT FILES              
 OUTFIL INCLUDE=(1,1,CH,EQ,C'1'),                                               
 FNAMES=HDR,                                                                    
 REMOVECC                                                                       
 OUTFIL FNAMES=NOTHDR,SAVE,                                                     
 REMOVECC                                                                       
