* FORCE HEADER AND DETAIL (RECORD TYPES 1 AND 3) TO TOP OF FILE                 
 SORT FIELDS=(1,1,AQ,A)                                                         
 ALTSEQ CODE=(F100,F301)                                                        
