  SORT FIELDS=COPY                                                              
  OUTFIL HEADER1=(C'RUN DATE & TIME:',DATE,1X,TIME),                            
  REMOVECC                                                                      
