  SORT   FIELDS=(1,8,CH,A),EQUALS                                               
  SUM    FIELDS=NONE                                                            
  OMIT   COND=(1,1,CH,LE,C'1')                                                  
