 SORT FIELDS=(54,9,CH,A)                                                        
 SUM  FIELDS=NONE                                                               
 OUTREC FIELDS=(54,9)                                                           
