 SORT FIELDS=COPY                                                               
 OUTFIL FNAMES=SORTOF1,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'001'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 001 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
 OUTFIL FNAMES=SORTOF2,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'002'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 002 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
 OUTFIL FNAMES=SORTOF3,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'003'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 003 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
 OUTFIL FNAMES=SORTOF4,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'004'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 004 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
 OUTFIL FNAMES=SORTOF5,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'005'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 005 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
 OUTFIL FNAMES=SORTOF6,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'006'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 006 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
 OUTFIL FNAMES=SORTOF7,                                                         
 OUTREC=(1,29,30,9,ZD,EDIT=(III,III,IIT)),                                      
 INCLUDE=(1,03,CH,EQ,C'007'),                                                   
 TRAILER1=(1/,1:C'TOT FOR CYCLE 007 : ',                                        
 30:TOT=(30,9,ZD,EDIT=(III,III,IIT)),1/)                                        
