  SORT FIELDS=(12,11,CH,A,            RDW + MEMBER-ID                           
               29,16,CH,A),           RDW + DISTRIBUTION FILE                   
               EQUALS                                                           
