  SORT FIELDS=(44,7,CH,A,69,1,CH,A,70,1,CH,A)                                   
  OUTREC FIELDS=(69,1,X,44,7,X,55,4,BI,ZD,X,59,10,HEX,X,71,10,HEX)              
