 SORT FIELDS=(1,7,CH,A,8,11,CH,A,33,7,CH,A,133,3,CH,A)                          
 SUM FIELDS=(58,13,ZD,104,13,ZD)                                                
