 SORT FIELDS=(5,8,CH,D,14,11,CH,A)                                              
 OUTFIL FNAMES=SORTOF1,INCLUDE=(31,1,CH,EQ,C'M'),                               
 HEADER1=('***** MASTERCARD WORLDWIDE - NON COLLECTION ONLY  *****'),           
 HEADER2=(/,3:'COUNT',13:'MBRID',22:'ERRCD',28:'IND',40:'INFILE-ID',/),         
 OUTREC=(5,8,X,14,11,2X,26,4,2X,31,1,X,33,25),CONVERT                           
 OUTFIL FNAMES=SORTOF2,INCLUDE=(31,1,CH,EQ,C'C'),                               
 HEADER1=('*****  MASTERCARD WORLDWIDE - COLLECTION ONLY *****'),               
 HEADER2=(/,3:'COUNT',13:'MBRID',22:'ERRCD',28:'IND',40:'INFILE-ID',/),         
 OUTREC=(5,8,X,14,11,2X,26,4,2X,31,1,X,33,25),CONVERT                           
