  JOINKEYS FILE=F1,FIELDS=(12,11,A,   RDW + MEMBER ID                           
               29,16,A)               RDW + DISTRIBUTION FILE                   
  JOINKEYS FILE=F2,FIELDS=(12,11,A,   RDW + MEMBER ID                           
               29,16,A)               RDW + DISTRIBUTION FILE                   
  REFORMAT FIELDS=(F2:01,04,          RDW                                       
               F1:05,07,              RDW + MGOS ENDPOINT                       
               F2:12,11,              RDW + MEMBER ID                           
               F2:23,22,              RDW + DISTRIBUTION ID                     
               F1:45,01,              RDW + MGOS MEDIA CODE                     
               F2:45)                 RDW + APPLICATION DATA                    
  SORT FIELDS=COPY                                                              
