* COPYBOOK IP981201                                                             
 SORT FIELDS=(75,1,CH,A,107,1,CH,A)                                             
 SUM FIELDS=(130,11,PD)                                                         
 OUTREC FIELDS=(C'DIRECTION = ',75,1,                                  +        
                C' DR/CR = ',107,1,                                    +        
                C' AMOUNT IN USD = ',130,9,HEX)                                 
