*-----------------------------------------------------------------------        
*THIS SORT CONTROL CARD IS TO COUNT THE TOTAL NUMBER OF RECORDS                 
*IN INPUT FILE OF VARIABLE FORMAT                                               
*-----------------------------------------------------------------------        
  INREC FIELDS=(01,04,X,C'0000000001')                                          
  SORT FIELDS=(05,01,CH,A)                                                      
  SUM FIELDS=(06,10,ZD)                                                         
  OUTFIL FNAMES=SORTOUT,OUTREC=(06,10),CONVERT                                  
