  SORT FIELDS=(1,1,CH,A,2,11,CH,A,13,11,CH,A,24,25,CH,A,113,3,CH,A)             
  SUM FIELDS=(50,16,ZD,66,16,ZD,82,16,ZD)                                       
