*----------------------------------------------------------------------         
*SORT CONTROL CARD TO GENERATE FILE REPRIORITY STATS REPORT PRODUCED            
*FROM THE OUTPUT FILE BY IP876120. ALSO, IT CREATES SPLUNK FEED                 
*----------------------------------------------------------------------         
 SORT FIELDS=COPY                                                               
 JOINKEYS FILE=F1,FIELDS=(01,11,A)                                              
 JOINKEYS FILE=F2,FIELDS=(03,11,A)                                              
 REFORMAT FIELDS=(F2:03,011,F2:15,30,                                           
                  F1:12,125,F2:01,01,F2:46,03)                                  
 OUTFIL FNAMES=SORTOF1,                                                         
    OUTREC=(1:DATE1(/),X,TIME,C'|REPRY|CYC_ID =',X'7F',C'0',                    
            166,01,X'7F',C'|PROC_DT =',X'7F',8X,X'7F',                          
            C'|PROC_ID =',X'7F',                                                
            001,11,X'7F',C'|MEMBER_NAME =',X'7F',                               
            012,30,X'7F',C'|REGION =',X'7F',                                    
            167,01,X'7F',C'|COUNTRY =',X'7F',                                   
            168,03,X'7F',C'|GFT_DATASET_NAME =',X'7F',                          
            042,44,X'7F',C'|AVAIL_TMS =',X'7F',                                 
            086,26,X'7F',C'|OLD_PRTY =',X'7F',                                  
            112,02,PD,M11,LENGTH=2,X'7F',                                       
            C'|NEW_PRTY =',X'7F',                                               
            114,02,PD,M11,LENGTH=2,X'7F',                                       
            C'|UPD_IND =',X'7F',                                                
            116,01,X'7F',                                                       
            C'|UPD_TMS =',X'7F',                                                
            117,26,X'7F',                                                       
            C'|NET_GLBL_TXN_AMT =',X'7F',                                       
            143,13,PD,M11,LENGTH=15,X'7F',                                      
            C'|NET_GLBL_TXN_CNT =',X'7F',                                       
            156,10,PD,M11,LENGTH=12,X'7F',C'|',2090X)                           
 OUTFIL FNAMES=SORTOF2,                                                         
    HEADER1=(1/,1'IP876120-AA',                                                 
               40X,1'CLEARING SETTLEMENT REPRIORITIZA',                         
               'TION - DETAIL REPORT',                                          
               5X,160:C'DATE: ',DATE=(MD4/),X,TIME,/),                          
     HEADER2=(C'CYC',X,                                                         
              C'  SNDR MBR',10X,                                                
              C'MBR NAME',15X,                                                  
              C'COUNTRY',X,                                                     
              C'REGION',14X,                                                    
              C'GFT DASET NAM',25X,                                             
              C'AVAIL TIMESTAMP',7X,                                            
              C'OLD',2X,                                                        
              C'NEW',2X,                                                        
              C'UPD',9X,                                                        
              C'UPD TIMESTAMP',17X,                                             
              C'NET GLBL TXN. AMT',7X,                                          
              C'TRAN. CNT',6X,                                                  
              C'CURRENT TIMESTMP',/,135X,                                       
              C'PRY',2X,                                                        
              C'PRY',X,/),                                                      
     OUTREC=(001:X,                                                             
             166,01,2X,                                                         
             001,11,X,                                                          
             012,30,3X,                                                         
             168,03,6X,                                                         
             167,01,3X,                                                         
             042,44,2X,                                                         
             086,26,2X,                                                         
             112,02,PD,M11,LENGTH=2,3X,                                         
             114,02,PD,M11,LENGTH=2,3X,                                         
             116,01,3X,                                                         
             117,26,X,                                                          
             143,13,PD,EDIT=($III,III,III,III,III,IIT.TT),X,                    
             156,10,PD,EDIT=(III,III,III,IIT),X,DATE5)                          
