  SORT FIELDS=(001,103,CH,A,104,103,CH,A,                                       
                236,003,CH,A,                                                   
                250,007,CH,A,                                                   
                257,002,CH,A,                                                   
                313,007,CH,A,                                                   
                320,002,CH,A)                                                   
  SUM FIELDS=(365,11,PD,376,11,PD,                                              
               387,11,PD,398,11,PD,                                             
               409,11,PD,420,11,PD,                                             
               431,06,PD,                                                       
               437,11,PD,448,11,PD,                                             
               459,11,PD,470,11,PD,                                             
               481,11,PD,492,11,PD,                                             
               503,06,PD)                                                       
