  SORT FIELDS=(1,7,ZD,A,8,11,ZD,A,19,2,CH,A,21,4,ZD,A,25,3,ZD,A),EQUALS         
  SUM FIELDS=(28,8,BI)                                                          
