  INREC FIELDS=(1,9,C' => PROCESS DATE')                                        
  SORT FIELDS=COPY                                                              
  OUTREC FIELDS=(2,8,10,16),CONVERT                                             
