  INREC FIELDS=(1,7,8:X'000000000000001C')                                      
  SORT FIELDS=(1,7,CH,A)                                                        
  SUM FIELDS=(8,8,PD)                                                           
  OUTFIL OUTREC=(1,7,X,8,8,PD,M11)                                              
