  SORT FIELDS=COPY                                                              
  OUTFIL FNAMES=SORTOF1,OUTREC=(68,44,36X),CONVERT                              
  OUTFIL FNAMES=SORTOF2,INCLUDE=(24,1,CH,EQ,C'Y'),                              
  OUTREC=(1,6,PD,M11,C';',7,5,PD,M11,C';',                                      
  12,4,BI,M11,C';',16,5,BI,M11,C';',24,1,C';',                                  
  25,44,C';',69,44,C';',113,9,122,6,PD,M11,128,3,PD,M11)                        
  OUTFIL FNAMES=SORTOF3,INCLUDE=(24,1,CH,NE,C'Y'),                              
  OUTREC=(1,6,PD,M11,C';',7,5,PD,M11,C';',                                      
  12,4,BI,M11,C';',16,5,BI,M11,C';',24,1,C';',                                  
  25,44,C';',69,44,C';',113,9,122,6,PD,M11,128,3,PD,M11)                        
