  SORT FIELDS=(52,3,CH,A)                                                       
  SUM FIELDS=(56,9,ZD,118,8,ZD)                                                 
  INREC BUILD=(1,126,24X)                                                       
  OUTFIL FNAMES=SORTOUT,OUTREC=(1:C'CLR',4:52,3,ZD,M10,7:C':',                  
  8:56,9,ZD,DIV,118,8,ZD,MUL,+60,M12,LENGTH=12,130X),                           
  HEADER1=(1:C'**START OF TPM COUNT**'),                                        
  TRAILER1=(1:C'**END OF TPM COUNT**')                                          
