  SORT FIELDS=(45,2,A,48,17,A),FORMAT=CH,EQUALS                                 
  INCLUDE COND=(20,1,CH,EQ,C'5',AND,21,1,CH,EQ,C'4')                            
  OUTFIL FNAMES=SORTOUT,VTOF,OUTREC=(5,30000)                                   
