  REPRO  INFILE(INDD1) OUTFILE(OUTDD1)                                          
  REPRO  INFILE(INDD2) OUTFILE(OUTDD2)                                          
  REPRO  INFILE(INDD3) OUTFILE(OUTDD3)                                          
